app/controllers/hero_powers_controller.rb

INSERT INTO "hero_powers" ("strength", "hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Average"], ["hero_id", 3], ["power_id", 1], ["created_at", "2022-10-07 18:19:58.205234"], ["updated_at", "2022-10-07 18:19:58.205234"]]
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def create
        hero_powers= HeroPower.create!(hero_powers_params)
        hero_record = Hero.find(hero_powers.hero_id)

SELECT "hero_powers".* FROM "hero_powers"
---
    def index
        hero_power= HeroPower.all