app/controllers/powers_controller.rb

    def index
        power = Power.all
---
SELECT "powers".* FROM "powers"

    def update
        power = find_params
        power.update!(power_params)
---
UPDATE "powers" SET "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["description", "gives the wielder super-human strengths"], ["updated_at", "2022-10-07 18:02:09.899123"], ["id", 1]]

    def find_params
        Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]